app/controllers/consultas_controller.rb

  def consulta_geral
  $tipo_con = 10
  @professor_rel_geral = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = 2015 and professors.desligado = 0"], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 877)
SELECT `tempo_servicos`.* FROM `tempo_servicos` INNER JOIN `professors` ON `professors`.id = `tempo_servicos`.professor_id WHERE (tempo_servicos.ano_letivo = 2016 and professors.desligado = 0) ORDER BY tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC

  def consulta_funcao
    session[:funcao] =  params[:search]
    if session[:funcao].nil?
      @professor_consulta_funcao=nil
    else
       if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then

             if session[:funcao] == 'ADI / Prof. de Creche'
                @professor_consulta_funcao = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.funcao2 = 'ADI / Prof. de Creche'", Time.current.strftime("%Y").to_i,], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
             else
                @professor_consulta_funcao = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.funcao like ?", Time.current.strftime("%Y").to_i, session[:funcao]], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
             end


      else
             @professor_consulta_funcao = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.funcao like ? and (professors.sede_id = ? or sede_id = 54)" , Time.current.strftime("%Y").to_i, session[:funcao], current_user.unidade_id ], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 382)
SELECT `tempo_servicos`.* FROM `tempo_servicos` INNER JOIN `professors` ON `professors`.id = `tempo_servicos`.professor_id WHERE (tempo_servicos.ano_letivo = 2016 and professors.desligado = 0 and professors.funcao like 'Diretor Ed. Básica' and (professors.sede_id = 45 or sede_id = 54)) ORDER BY tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 24)

  def consulta_unidade
    $uni = params[:search]
    if $uni.nil?
      @professor_consulta_unidade=nil
    else
       if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then
            @professor_consulta_unidade = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.sede_id = ?", Time.current.strftime("%Y").to_i, $uni ], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')

      else
             @professor_consulta_unidade = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and orifessirs.desligado = 0 and professors.sede_id = ? and (professors.sede_id = ? or sede_id = 54)" , Time.current.strftime("%Y").to_i, $uni, current_user.unidade_id ], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 31)
SELECT `tempo_servicos`.* FROM `tempo_servicos` INNER JOIN `professors` ON `professors`.id = `tempo_servicos`.professor_id WHERE (tempo_servicos.ano_letivo = 2016 and professors.desligado = 0 and professors.sede_id = '45' and (professors.sede_id = 45 or sede_id = 54)) ORDER BY tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 45)

  def consulta_unidade_funcao
    $uni = params[:search]
    session[:funcao] = params[:search1]
    if $uni.nil?
       @professor_consulta_unidade_funcao=nil
    else
       if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then
            @professor_consulta_unidade_funcao = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.sede_id = ? and professors.funcao2 = 'ADI / Prof. de Creche'", Time.current.strftime("%Y").to_i, $uni ], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
      else
            if session[:funcao] == 'ADI/Prof.Creche'
               @professor_consulta_unidade_funcao = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.sede_id = ? and professors.funcao like ? and (professors.sede_id = ? or sede_id = 54)", Time.current.strftime("%Y").to_i, $uni, session[:funcao], current_user.unidade_id ], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 1010)
SELECT `tempo_servicos`.* FROM `tempo_servicos` INNER JOIN `professors` ON `professors`.id = `tempo_servicos`.professor_id WHERE (tempo_servicos.ano_letivo = 2016 and professors.desligado = 0 and professors.sede_id = '45' and professors.funcao like 'Diretor Ed. Básica' and (professors.sede_id = 45 or sede_id = 54)) ORDER BY tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 45)

 def impressao_geral
        $tipo_con = 10
        if (session[:tipoclassificacao]== 'CLASSIFICACÃO GERAL')
         @professor_impressao = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0", Time.current.strftime("%Y").to_i], :order => 'tempo_servicos.pontuacao_geral DESC')
        else if (session[:tipoclassificacao] == 'CLASSIFICACÃO P/ FUNÇÂO')

                 if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then
                         if session[:funcao] == 'ADI / Prof. de Creche'
                               @professor_impressao = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.funcao2 = 'ADI / Prof. de Creche'", Time.current.strftime("%Y").to_i,], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
                         else
                            @professor_impressao = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.funcao like ?", Time.current.strftime("%Y").to_i, session[:funcao]], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
                         end
                  else
#                         @professor_impressao = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.funcao like ? and (professors.sede_id = ? or sede_id = 54)" , Time.current.strftime("%Y").to_i, session[:funcao], current_user.unidade_id ], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
                   end
             else if (session[:tipoclassificacao] == 'CLASSIFICACÃO P/ UNIDADE')
                         if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then
                           @professor_impressao  = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and professors.desligado = 0 and professors.sede_id = ?", Time.current.strftime("%Y").to_i, $uni ], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
                         else
                           @professor_impressao  = TempoServico.find(:all,:joins => :professor, :conditions=> ["tempo_servicos.ano_letivo = ? and orifessirs.desligado = 0 and professors.sede_id = ? and (professors.sede_id = ? or sede_id = 54)" , Time.current.strftime("%Y").to_i, $uni, current_user.unidade_id ], :order => 'tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC')
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 1009)
SELECT `tempo_servicos`.* FROM `tempo_servicos` INNER JOIN `professors` ON `professors`.id = `tempo_servicos`.professor_id WHERE (tempo_servicos.ano_letivo = 2016 and professors.desligado = 0 and professors.funcao2 = 'ADI / Prof. de Creche') ORDER BY tempo_servicos.pontuacao_geral DESC,dt_ingresso DESC,dt_nasc,n_filhos DESC
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 52)