app/controllers/professors_controller.rb

def impressao

        @temposervico = TempoServico.find(:all,:conditions =>['professor_id = ? and ano_letivo = ?', session[:teacher1], session[:ano]])
        @professor= Professor.find(:all,:conditions => ["id = ? and desligado = 0",session[:teacher1]])
         @tp = TituloProfessor.all(:joins => "inner join titulacaos on titulo_professors.titulo_id = titulacaos.id", :conditions =>["titulo_professors.professor_id =? and ano_letivo between ? and ? and titulacaos.tipo = 'PERMANENTE'", session[:teacher1], 2009, session[:ano]] )
---
SELECT * FROM `tempo_servicos` WHERE (professor_id = '1033' and ano_letivo = '2016')
SELECT * FROM `professors` WHERE (desligado = 0) ORDER BY matricula ASC
SELECT * FROM `professors` ORDER BY matricula ASC
SELECT `titulo_professors`.* FROM `titulo_professors` inner join titulacaos on titulo_professors.titulo_id = titulacaos.id WHERE (titulo_professors.professor_id ='1033' and ano_letivo between 2009 and '2016' and titulacaos.tipo = 'PERMANENTE')

  def load_unidades
     @cargos = Cargo.find(:all, :order=>'id ASC')
    if current_user.unidade_id == 53 or current_user.unidade_id == 52 then
      @unidades = Unidade.find(:all, :order => "nome")
---
SELECT * FROM `unidades` WHERE (id = 43 or id = 54) ORDER BY nome ASC

  def load_professors
      @professors = Professor.find(:all, :order => 'nome ASC')
      @professors1 = Professor.find(:all, :order => 'matricula ASC')
---
SELECT * FROM `professors` WHERE (nome like '%maria%' and (sede_id = 43 or sede_id = 54)) ORDER BY sede_id,nome ASC
SELECT `professors`.id FROM `professors` WHERE (`professors`.`matricula` = 901462 AND `professors`.id <> 1071) LIMIT 1

  def create
    @professor = Professor.new(params[:professor])

    respond_to do |format|
      if @professor.save
---
INSERT INTO `professors` (`CPF`, `funcao2`, `num`, `matricula`, `dt_ingresso`, `dt_nasc`, `sede_id`, `total_trabalhado`, `log_user`, `prioridade`, `n_filhos`, `endres`, `cidade`, `email`, `created_at`, `nome`, `motivo`, `dt_atual`, `obs`, `total_titulacao`, `sede_id_ant`, `updated_at`, `INEP`, `telefone`, `titulo_arrumado`, `bairro`, `desligado`, `complemento`, `jornada_sem`, `funcao`, `entrada_concurso`, `RG`, `RD`, `data_desligado`, `cel`, `cep`, `pontuacao_final`, `flag`) VALUES('0', NULL, NULL, 12312312121, '2011-09-05', '1979-09-04', 3, 0, NULL, 0, 0, '', '', '', '2016-09-21 12:43:14', 'ASDASDA', NULL, NULL, '', 0, NULL, '2016-09-21 12:43:14', 0, NULL, NULL, '', 0, '', 0, 'PROF. DE CRECHE', 'Pedagogia / Normal Superior', '0', 0, NULL, '', '', 0, 0)

  def update
    @professor = Professor.find(params[:id])
    t=0
    respond_to do |format|
      if @professor.update_attributes(params[:professor])
---
UPDATE `professors` SET `obs` = '', `funcao` = 'DIRETOR ED. BáSICA', `motivo` = '', `dt_nasc` = '2016-09-23', `complemento` = '', `updated_at` = '2016-09-23 16:26:23', `dt_ingresso` = '2016-09-23', `entrada_concurso` = 'Sem Magistério / Pedagogia', `cidade` = '', `bairro` = '', `data_desligado` = '2016-09-23', `endres` = '' WHERE `id` = 1333

def consulta_ficha_pontuacao
     session[:teacher1] = params[:consulta][:professor_id]
     session[:ano] = params[:ano_letivo]
     $ANO_ANO = session[:ano]
     $TEACHER_TEACHER = session[:teacher1]

        @temposervico = TempoServico.find(:all,:conditions =>['professor_id = ? and ano_letivo = ?', session[:teacher1], session[:ano]])
        @professor= Professor.find(:all,:conditions => ["id = ? and desligado = 0",session[:teacher1]])
         @tp = TituloProfessor.all(:joins => "inner join titulacaos on titulo_professors.titulo_id = titulacaos.id", :conditions =>["titulo_professors.professor_id =? and ano_letivo between ? and ? and titulacaos.tipo = 'PERMANENTE'", session[:teacher1], 2009, session[:ano] ])
---
SELECT * FROM `tempo_servicos` WHERE (professor_id = '1033' and ano_letivo = '2016')
SELECT * FROM `professors` ORDER BY matricula ASC
SELECT `titulo_professors`.* FROM `titulo_professors` inner join titulacaos on titulo_professors.titulo_id = titulacaos.id WHERE (titulo_professors.professor_id ='1033' and ano_letivo between 2009 and '2016' and titulacaos.tipo = 'PERMANENTE')
SELECT sum(`titulo_professors`.pontuacao_titulo) AS sum_pontuacao_titulo FROM `titulo_professors` WHERE (professor_id = 383 and titulo_id between 6 and 12 and ano_letivo = 2016)

def load_consulta_ano
    @ano = TituloProfessor.find(:all,:select => 'distinct(ano_letivo) as ano',:order => 'ano_letivo DESC')
---
SELECT distinct(ano_letivo) as ano FROM `titulo_professors` WHERE (ano_letivo > 2014) ORDER BY ano_letivo DESC

def consulta_ficha

@tp = TituloProfessor.all(:joins => "inner join titulacaos on titulo_professors.titulo_id = titulacaos.id", :conditions =>["titulo_professors.professor_id =? and ano_letivo = ? and titulacaos.tipo = 'ANUAL'", $teacher,session[:ano]] )
---
SELECT * FROM `professors` ORDER BY matricula ASC
SELECT `titulo_professors`.* FROM `titulo_professors` inner join titulacaos on titulo_professors.titulo_id = titulacaos.id WHERE (titulo_professors.professor_id =NULL and ano_letivo = 2016 and titulacaos.tipo = 'ANUAL')