app/controllers/tempo_servicos_controller.rb

 def impressao
        @professor= Professor.find(:all,:conditions => ["id = ?  and desligado = 0",session[:teacher]])
        @temposervico = TempoServico.find(:all,:conditions =>['professor_id = ? and ano_letivo = ?', session[:teacher], session[:ano_letivo]])
---
SELECT * FROM `professors` WHERE (desligado = 0 ) ORDER BY matricula ASC
SELECT * FROM `tempo_servicos` WHERE (professor_id = '1328' and ano_letivo = 2016)

  def show
    @temposervico = TempoServico.find(params[:id])
    profid = @temposervico.professor_id
    @professor = Professor.find(:all, :conditions  => ["id = ? and desligado = 0", profid])
---
SELECT * FROM `tempo_servicos` WHERE (`tempo_servicos`.`id` = 2454)
SELECT * FROM `professors` WHERE (desligado = 0 ) ORDER BY matricula ASC

  def edit
    @temposervico = TempoServico.find(params[:id])
---
SELECT * FROM `tempo_servicos` WHERE (`tempo_servicos`.`id` = 2455)

  redets=0
  unidts=0
  anoanteiror =  ((Time.current.strftime("%Y").to_i)-1)
  @total_anterior = TempoServico.find(:all , :conditions => ['professor_id =? and ano_letivo = ?',professor_id, anoanteiror])
---
SELECT * FROM `tempo_servicos` WHERE (professor_id =595 and ano_letivo = 2015)


# def atualiza_pontos_tabela_professor

     @professor= Professor.find(@temposervico.professor_id)
     @professor.total_trabalhado= @temposervico.total_geral_tempo_servico
     @professor.pontuacao_final= geral_titulo + @temposervico.total_geral_tempo_servico

     @professor.save
---
SELECT * FROM `professors` WHERE (desligado = 0 ) ORDER BY matricula ASC
INSERT INTO `tempo_servicos` (`total_ant_unid`, `total_efetivo`, `unidade1`, `unidade2`, `total_ant_efetivo`, `total_rede`, `f_atestado1`, `afastamento1`, `f_atestado2`, `afastamento2`, `dias_unidade1`, `dias_unidade2`, `subtot_unid`, `total_dias`, `total_geral_trab`, `dias_trab1`, `dias_rede1`, `dias_trab2`, `dias_rede2`, `total_ant_dias`, `total_geral_efet`, `created_at`, `f_justif1`, `lic_saude1`, `outras_aus1`, `f_justif2`, `lic_saude2`, `outras_aus2`, `subtot_rede`, `pontuacao_geral`, `f_abonada1`, `f_abonada2`, `subtot_efetivo`, `dias1`, `dias_efetivos1`, `dias2`, `dias_efetivos2`, `subtot_dias`, `total_trab`, `professor_id`, `ano_letivo`, `ano1`, `ano2`, `updated_at`, `f_injustif1`, `f_injustif2`, `total_ant_rede`, `total_geral_tempo_servico`, `outro_trab1`, `outro_trab2`, `total_unid`, `remocao`) VALUES(0, 21304, 0, 0, 70162, 9397, 0, 0, 0, 0, 0, 0, 0, 70846, 0, 179, 184, 163, 182, 17884, 0, '2016-09-26 14:07:27', 1, 0, 0, 0, 16, 0, 366, 106567, 2, 3, 342, 184, 179, 182, 163, 342, 0, 568, 2016, 2015, 2016, '2016-09-26 14:07:27', 2, 0, 9031, 101547, 0, 0, 0, NULL)

  def update
    @temposervico = TempoServico.find(params[:id])

    respond_to do |format|
      if @temposervico.update_attributes(params[:tempo_servico])
---
SELECT * FROM `tempo_servicos` WHERE (professor_id =1328 and ano_letivo = 2015)
UPDATE `tempo_servicos` SET `dias_efetivos1` = 24, `total_dias` = 67626, `dias_trab2` = 158, `total_efetivo` = 18608, `subtot_efetivo` = 182, `dias_efetivos2` = 158, `dias_trab1` = 160, `total_geral_tempo_servico` = 95099, `subtot_dias` = 318, `pontuacao_geral` = 95111, `updated_at` = '2016-09-26 14:15:08' WHERE `id` = 2607


# def atualiza_pontos_tabela_professor

     @professor= Professor.find(@temposervico.professor_id)
---
SELECT * FROM `professors` WHERE (desligado = 0 ) ORDER BY matricula ASC

 def sel_prof
        existe = 1
      $teacher = params[:titulo_professor_professor_id]
      session[:teacher]= params[:titulo_professor_professor_id]

        $professor_id = $teacher
        session[:professor_id] = session[:teacher]
        $id_professor = $professor_id
        session[:id_professor]= session[:professor_id]
        session[:professor] = Professor.find(session[:teacher]).nome
        $professor = Professor.find(session[:teacher]).nome
        @professor = Professor.find(:all,:conditions => ['id = ? and desligado = 0 ', session[:teacher]])
        t=Time.current.strftime("%Y").to_i
        t1=session[:teacher]
        w=0
        @temposervico = TempoServico.find(:all,:conditions =>['professor_id = ?  and ano_letivo = ?', session[:teacher], Time.current.strftime("%Y").to_i])
---
SELECT * FROM `professors` WHERE (desligado = 0 ) ORDER BY matricula ASC
SELECT * FROM `tempo_servicos` WHERE (professor_id = '595' and ano_letivo = 2016)

def consulta_tempo_servico

      teacher = params[:consulta][:professor_id]
      $teacher_ts = params[:consulta][:professor_id]
      #$teache_anterior =  session[:teacher]
       $ano =(Time.now.year)
       session[:ano_letivo]= params[:ano_letivo]
       @professor= Professor.find(:all,:conditions => ["id = ? and desligado = 0",teacher])
       @temposervico = TempoServico.find(:all,:conditions =>['professor_id = ? and ano_letivo = ?', teacher, session[:ano_letivo]])
---
SELECT * FROM `professors` WHERE (desligado = 0 ) ORDER BY matricula ASC
SELECT * FROM `tempo_servicos` WHERE (professor_id = '1292' and ano_letivo = 2016)

  def load_professors
    @professors = Professor.find(:all,:conditions => ['desligado = 0 '] , :order => "matricula ASC")
---
SELECT * FROM `professors` WHERE (desligado = 0 ) ORDER BY matricula ASC

  def load_consulta_ano
    @ano = TempoServico.find(:all,:select => 'distinct(ano_letivo) as ano',:order => 'ano_letivo DESC')
---
SELECT distinct(ano_letivo) as ano FROM `tempo_servicos` WHERE (ano_letivo > 2014) ORDER BY ano_letivo DESC