app/controllers/titulo_professors_controller.rb

def consulta_titulacao_professor
   if (params[:search].nil? || params[:search].empty?)
      titulo = 0
      $titulo = 0
   else
      titulo = params[:search][:search]
      $titulo = params[:search][:search]
   end
    if $titulo != 0
           @tp = TituloProfessor.all(:joins => "inner join titulacaos on titulo_professors.titulo_id = titulacaos.id", :conditions =>["titulo_professors.titulo_id =?  ", $titulo] )
---
SELECT * FROM `professors` WHERE (sede_id = 43 or sede_id = 54) ORDER BY nome

  def index
    @titulo_professors = TituloProfessor.find(:all, :conditions => ['professor_id =?', session[:teacher]])
---
SELECT * FROM `professors` WHERE (sede_id = 43 or sede_id = 54) ORDER BY nome
SELECT * FROM `titulo_professors` WHERE (professor_id ='934')

  def show
    @titulo_professor = TituloProfessor.find(params[:id])
---
SELECT * FROM `professors` WHERE (sede_id = 2 or sede_id = 54 and desligado = 0) ORDER BY nome
SELECT * FROM `titulo_professors` WHERE (professor_id = 183 and titulo_id between 6 and 12 and ano_letivo= 2016)
SELECT sum(`titulo_professors`.pontuacao_titulo) AS sum_pontuacao_titulo FROM `titulo_professors` WHERE (professor_id = 183 and titulo_id between 6 and 12 and ano_letivo = 2016)

  def create
    @titulo_professor = TituloProfessor.new(params[:titulo_professor])
    @titulo_professor.valor= session[:valor]
    @titulo_professor.ano_letivo =Time.current.strftime("%Y")
    @titulo_professor.tipo_curso


    #@titulo_professor.user = current_user.id
    #@titulo_professor.current = Time.current
    @titulo_professor.tipo_curso
    #@titulo_professor.begin_period = "#{session[:begin_period]}"
    #@titulo_professor.end_period =  "#{session[:end_period]}"
    #@log = Log.new
    #@log.log(current_user.id, @titulo_professor.professor_id, "Cadastrado Titulo do professor.")
    respond_to do |format|
      if @titulo_professor.save
---
INSERT INTO `titulo_professors` (`obs`, `pontuacao_titulo`, `total_anual`, `ano_letivo`, `tipo_curso`, `created_at`, `professor_id`, `dt_validade`, `updated_at`, `quantidade`, `total_permanente`, `total_titulacao`, `titulo_id`, `valor`, `dt_titulo`) VALUES('ALFABETIZAÇÃO E L...', 2000, 0, 2016, 1, '2016-09-21 13:58:34', 787, NULL, '2016-09-21 13:58:34', 1, 17000, 17000, 2, 2000, '2015-09-21')

  def destroy
    $r =TituloProfessor.find(params[:id])
    @titulo_professor = TituloProfessor.find(params[:id])
    #@at_log = Log.new
    #@at_log.titulacao_id = @titulo_professor.id
    #@at_log.obs = "Atualizado"
    #@at_log.professor_id = @titulo_professor.professor_id
    #@at_log.user_id = current_user.id
    #@at_log.save
    @titulo_professor.destroy
---
SELECT * FROM `professors` WHERE (sede_id = 43 or sede_id = 54) ORDER BY nome
SELECT * FROM `titulo_professors` WHERE (`titulo_professors`.`id` = 27175)
DELETE FROM `titulo_professors` WHERE `id` = 27175

  def sel_prof
    $teacher = params[:titulo_professor_professor_id]
    session[:teacher]=params[:titulo_professor_professor_id]
    if !(session[:teacher].nil? or session[:teacher].empty?) or session[:teacher] == '' then
      if (Professor.find(session[:teacher])).nil? then
---
SELECT * FROM `professors` WHERE (sede_id = 46 or sede_id = 54 and desligado = 0) ORDER BY matricula ASC

  def guarda_valor

    $id_titulo = params[:titulo_professor_titulo_id]
    session[:valor] = Titulacao.find_by_id($id_titulo).valor
---
SELECT * FROM `titulacaos` WHERE (`titulacaos`.`id` = '1') LIMIT 1

 def titulos_busca
     $professor = Professor.find(params[:altera_professor_id]).nome
     @titulo_busca =  TituloProfessor.find(:all,:conditions =>['professor_id = ? and (ano_letivo = ? or titulo_id in (1,2,3,4,5))',params[:altera_professor_id],Time.current.strftime("%Y")], :order => "created_at DESC")
---
SELECT * FROM `professors` WHERE (sede_id = 43 or sede_id = 54) ORDER BY nome
SELECT * FROM `titulo_professors` WHERE (professor_id = '816' and (ano_letivo = '2016' or titulo_id in (1,2,3,4,5))) ORDER BY created_at DESC

 def impressao
        @professor= Professor.find(:all,:conditions => ["id = ?  and desligado = 0",session[:teacher]])
        @tp = TituloProfessor.all(:joins => "inner join titulacaos on titulo_professors.titulo_id = titulacaos.id", :conditions =>["titulo_professors.professor_id =? and ano_letivo between ? and ? and titulacaos.tipo = 'PERMANENTE'", session[:teacher], 2009,$session[:ano]] )
---
SELECT * FROM `professors` WHERE (sede_id = 43 or sede_id = 54) ORDER BY nome
SELECT `titulo_professors`.* FROM `titulo_professors` inner join titulacaos on titulo_professors.titulo_id = titulacaos.id WHERE (titulo_professors.professor_id ='183' and ano_letivo between 2009 and 2016 and titulacaos.tipo = 'PERMANENTE')

def consulta_titulo_professor
     $teacher = params[:consulta][:professor_id]
      $ano = params[:ano_letivo]
      session[:ano]= params[:ano_letivo]
        @professor= Professor.find(:all,:conditions => ["id = ? and desligado = 0",session[:teacher]])
        @tp = TituloProfessor.all(:joins => "inner join titulacaos on titulo_professors.titulo_id = titulacaos.id", :conditions =>["titulo_professors.professor_id =? and ano_letivo between ? and ? and titulacaos.tipo = 'PERMANENTE'", session[:teacher], 2009,session[:ano]] )
---
SELECT * FROM `professors` WHERE (sede_id = 46 or sede_id = 54 and desligado = 0) ORDER BY matricula ASC
SELECT `titulo_professors`.* FROM `titulo_professors` inner join titulacaos on titulo_professors.titulo_id = titulacaos.id WHERE (titulo_professors.professor_id ='183' and ano_letivo between 2009 and '2016' and titulacaos.tipo = 'PERMANENTE')

  def load_titulacao
    @titulacaos = Titulacao.find(:all)
---
SELECT * FROM `titulacaos` WHERE (ano_letivo_titulacao > 2014 or ano_letivo_titulacao =0)

  def load_professors
    @professors = Professor.find(:all, :conditions => ["desligado = 0"], :order => "matricula ASC")
---
SELECT * FROM `professors` WHERE (sede_id = 46 or sede_id = 54 and desligado = 0) ORDER BY matricula ASC

  def load_professors1
    @professors1 = Professor.find(:all, :conditions => ["desligado = 0"], :order => "nome ASC")
    @professors11 =  Professor.all(:conditions => ['sede_id = ' + current_user.unidade_id.to_s + ' or sede_id = 54'], :order => 'nome')
---
SELECT * FROM `unidades` WHERE (id=43)

  def load_consulta_ano
    @ano = TituloProfessor.find(:all,:select => 'distinct(ano_letivo) as ano',:order => 'ano_letivo DESC')
---
SELECT * FROM `titulo_professors` WHERE (professor_id = 934 and titulo_id between 6 and 12 and ano_letivo= 2016)
SELECT sum(`titulo_professors`.pontuacao_titulo) AS sum_pontuacao_titulo FROM `titulo_professors` WHERE (professor_id = 934 and titulo_id between 6 and 12 and ano_letivo = 2016)