app/controllers/users_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY 'teste1') LIMIT 1
---
  def load_users
    @users =User.find(:all, :order => 'login ASC')

SELECT * FROM `users` ORDER BY login ASC
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
    if success && @user.errors.empty?

SELECT * FROM `unidades` ORDER BY nome ASC
---
  def load_resources
    @unidades = Unidade.all